var bulgarian = {
    config : {
        max_names_count : 1,
    },

    name_m : [
        "Александър","Алекси","Анастас","Ангел","Андон","Андрей","Антон","Апостол","Асен","Аспарух","Атанас","Бисер","Благой","Богдан","Богомил","Божидар","Бойко","Бойчо","Бончо","Борис","Борислав","Боян","Валентин","Валери","Ваньо","Ваня","Васил","Васко","Велико","Велин","Величко","Велко","Венко","Венцислав","Веселин","Веско","Виктор","Владимир","Владислав","Вълко","Вълчо","Върбан","Галин","Ганчо","Гено","Генчо","Георги","Господин","Григор","Дамян","Данаил","Даниел","Данчо","Делчо","Денчо","Деян","Димитър","Димитьр","Димо","Димчо","Динко","Добри","Добрин","Добромир","Дончо","Драган","Драгомир","Евгени","Евтим","Емил","Енчо","Жеко","Жельо","Желязко","Живко","Захари","Здравко","Златко","Ивайло","Иван","Иво","Игнат","Илия","Илиян","Илко","Йордан","Йосиф","Калин","Камен","Кирил","Киро","Кольо","Колю","Константин","Костадин","Красимир","Кръстьо","Кръстю","Кънчо","Лазар","Лъчезар","Любен","Любомир","Любчо","Людмил","Манол","Марин","Марко","Мартин","Методи","Милан","Милен","Милко","Милчо","Минко","Минчо","Мирослав","Мирчо","Митко","Михаил","Младен","Найден","Неделчо","Недялко","Ненко","Нено","Никола","Николай","Огнян","Павел","Павлин","Панайот","Пенко","Пенчо","Пеньо","Петко","Петър","Петьо","Петьр","Петя","Пламен","Първан","Ради","Радко","Радослав","Райко","Райчо","Рангел","Росен","Румен","Руси","Сава","Сашо","Светлин","Светлозар","Светослав","Сергей","Симеон","Слави","Славчо","Спас","Станимир","Станислав","Станко","Станчо","Стефан","Стефчо","Стоил","Стойко","Стойчо","Стоян","Страхил","Тихомир","Тодор","Тома","Тончо","Тошко","Трендафил","Трифон","Филип","Христо","Цанко","Цветан","Цветко","Цвятко","Чавдар","Яни","Янко","Янчо",
    ],
    name_f : [
        "Адриана","Албена","Александра","Ана","Анастасия","Ангелина","Анелия","Анета","Анка","Анна","Антоанета","Антония","Ася","Атанаска","Бисерка","Бистра","Богдана","Божана","Божанка","Бойка","Бонка","Боряна","Валентина","Валерия","Валя","Ваня","Василка","Велика","Величка","Венета","Вера","Верка","Весела","Веселина","Веселка","Веска","Виктория","Виолета","Виолетка","Вяра","Галина","Галя","Ганка","Гена","Генка","Геновева","Гергана","Гергина","Гина","Гинка","Даниела","Данка","Дарина","Даринка","Дафинка","Денка","Десислава","Детелина","Диана","Димитра","Димитрина","Димитринка","Димитричка","Димка","Дияна","Добринка","Дора","Евгения","Евдокия","Евелина","Екатерина","Елена","Еленка","Елеонора","Елисавета","Елка","Емилия","Жана","Живка","Здравка","Златка","Зорка","Зоя","Иванка","Илиана","Ирена","Ирина","Искра","Йовка","Йорданка","Калина","Калинка","Камелия","Катерина","Катя","Кина","Коста","Костадинка","Красимира","Кристина","Кръстина","Лидия","Лилия","Лиляна","Люба","Любка","Людмила","Магдалена","Мара","Маргарита","Мариана","Мариела","Мариета","Марийка","Марина","Маринка","Мария","Марияна","Мая","Миглена","Милена","Милка","Минка","Надежда","Надка","Надя","Наталия","Наташа","Невена","Недка","Недялка","Николина","Николинка","Нина","Олга","Павлина","Параскева","Пенка","Петра","Петрана","Петранка","Петя","Рада","Радка","Радостина","Райна","Роза","Росица","Румяна","Руска","Сава","Светла","Светлана","Сийка","Силвия","Славка","Снежана","Снежанка","Соня","София","Спаска","Станка","Стела","Стефанка","Стефка","Стойка","Стоянка","Таня","Татяна","Теменужка","Теодора","Тинка","Тодора","Тодорка","Тома","Тонка","Тотка","Христина","Цанка","Цвета","Цветана","Цветанка","Цветелина","Ценка","Цеца","Цонка","Юлия","Юлияна","Яна","Янка",
    ],
    cognomen_m : [
        "Аврамов","Александров","Алексиев","Ангелов","Андонов","Андреев","Антонов","Апостолов","Арнаудов","Арнаутски","Асенов","Атанасов","Атов","Бежански","Богданов","Божилов","Божков","Бонев","Борисов","Бояджиев","Брусев","Бурджиев","Бърдарски","Бьчваров","Василев","Ватрачки","Велев","Велизаров","Великов","Велинов","Величков","Велков","Велчев","Владимиров","Вълев","Вълков","Вълчев","Върбанов","Габерски","Ганев","Ганчев","Генов","Генчев","Георгиев","Гергов","Горанов","Господинов","Гочев","Григоров","Дамянов","Даскалов","Денев","Димитров","Димов","Динев","Добрев","Донев","Дончев","Дочев","Драганов","Евтимов","Енев","Енчев","Жеков","Желев","Желязков","Захариев","Златев","Иванов","Игнатов","Илиев","Йовчев","Йорданов","Йосифов","Йотов","Калчев","Каменов","Кирилов","Киров","Ковачев","Коев","Колев","Константинов","Костадинов","Костов","Коцев","Кръстев","Кънев","Кънчев","Лазаров","Манов","Манолов","Манчев","Маринов","Марков","Миланов","Милев","Милушев","Минев","Минков","Минчев","Мирчев","Митев","Митов","Михайлов","Михов","Младенов","Найденов","Начев","Недев","Неделчев","Недялков","Ненов","Николов","Павлов","Панайотов","Панов","Панчев","Пеев","Пейчев","Пенев","Пенков","Пенчев","Петков","Петров","Пешев","Попов","Първанов","Радев","Райков","Рангелов","Рачев","Русев","Савов","Симеонов","Славов","Славчев","Соколов","Сотиров","Спасов","Стайков","Стаменов","Станев","Станков","Станчев","Стефанов","Стоев","Стоилов","Стоименов","Стоичков","Стойков","Стойчев","Стоянов","Събев","Танев","Тасев","Терзиев","Тодоров","Томов","Тонев","Тончев","Топалов","Тотев","Тошев","Трайков","Трифонов","Узунов","Филипов","Хаджиев","Христов","Цанев","Цанков","Цветанов","Цветков","Цеков","Ценов","Цонев","Чакъров","Чолаков","Шопов","Янакиев","Янев","Янков","Янчев",
    ],
    cognomen_f : [
        "Аврамова","Александрова","Алексиева","Алиева","Анастасова","Аначкова","Ангелкова","Ангелова","Андонова","Андреева","Антонова","Апостолова","Арабаджиева","Арнаудова","Арсова","Асенова","Атанасова","Байрактарова","Бакалска","Бакърджиева","Балабанова","Балинова","Барова","Благоева","Близнакова","Богданова","Божанова","Божилова","Божкова","Бозева","Бонева","Борисова","Ботушарова","Бояджиева","Будинова","Букова","Бъчварова","Василева","Велева","Великова","Велинова","Величкова","Велкова","Велчева","Видова","Владимирова","Влаева","Вучева","Вълева","Вълкова","Вълчанова","Вълчева","Върбанова","Въткова","Въчкова","Гавраилова","Ганева","Ганчева","Гатева","Гегова","Гекова","Генова","Геновска","Генчева","Георгиева","Герова","Гигова","Глушкова","Горанова","Господинова","Граматикова","Григорова","Гусева","Гълъбова","Гьошева","Гяурова","Дамянова","Данаилова","Даскалова","Дачева","Дашева","Делчева","Дерменджиева","Десподова","Джарова","Джонова","Димитрова","Димова","Динева","Дичева","Дишева","Добрева","Доганова","Додева","Донева","Дончева","Дочева","Драганова","Драгова","Душева","Дъбова","Дянкова","Евтимова","Енчева","Ефтимова","Жекова","Желева","Железчева","Желязкова","Жечева","Занева","Зарева","Захариева","Златева","Златинова","Иванова","Игнатова","Илиева","Искрова","Йовчева","Йорданова","Йосифова","Йотова","Кадийска","Калпакчиева","Калчева","Каменова","Карадимова","Караманова","Караянева","Кашева","Кирилова","Кирова","Кирякова","Ковачева","Коева","Койчева","Коларова","Колева","Колчева","Константинова","Костадинова","Костова","Коцева","Кочева","Крушкова","Кръстева","Кръчмарова","Кулова","Кумчева","Кунова","Куцарова","Куюмджиева","Кънева","Кънчева","Кърчева","Кътева","Кьосева","Кюркчиева","Лазарова","Лечева","Лолова","Лукова","Макавеева","Малакова","Маламова","Манова","Манолова","Манчева","Маринова","Маркова","Матеева","Медникарова","Мерджанова","Миланова","Милева","Миленкова","Милкова","Милушева","Милчева","Минева","Минкова","Минчева","Мирчева","Митева","Митова","Митрова","Михайлова","Михова","Младенова","Найденова","Налбантова","Нанова","Нацева","Начева","Недева","Неделчева","Недялкова","Ненова","Нестерова","Нешева","Николова","Нинкова","Ноева","Ножарова","Овчарова","Павлова","Панайотова","Панева","Панова","Панчева","Папазова","Пачева","Пеева","Пейчева","Пенева","Пенкова","Пенчева","Петкова","Петрова","Петрушева","Пешева","Пиперова","Помакова","Попова","Пройнова","Първанова","Пъшева","Радева","Радкова","Радоева","Райкова","Райчева","Райчинова","Рангелова","Ранкова","Рачева","Русева","Савова","Сарова","Симеонова","Сиракова","Славова","Славчева","Смилкова","Соколова","Сотирова","Спасова","Стайкова","Стаматова","Стаменова","Станева","Станкова","Станоева","Станчева","Стефанова","Стоева","Стоенчева","Стоилова","Стоименова","Стойкова","Стойчева","Стоянова","Събева","Танева","Танчева","Тасева","Таскова","Ташева","Тепавичарова","Терзиева","Тимова","Тодорова","Томова","Тонева","Тончева","Топалова","Тотева","Тошева","Трайкова","Трифонова","Троева","Узунова","Урумова","Филипова","Хаджиева","Хаджийска","Хинкова","Христева","Христова","Цанева","Цанкова","Цветанова","Цветкова","Цекова","Ценова","Цонева","Цончева","Цочева","Чакова","Чакърова","Чапкънова","Ченкова","Черкезова","Чиликова","Чокоева","Чолакова","Чонева","Шалева","Шопова","Юсеинова","Явашева","Янакиева","Яначкова","Янева","Янкова","Янчева",
    ],

    getRandomName : function(gender){
        let rnd = 0;

        let result = '';
        let original = '';
        let translated = '';

        var src_name;
        var src_cognomen;

        // установим сообразно гендеру
        if (gender == "male") {
            src_name = this.name_m;
            src_cognomen = this.cognomen_m;
        }
        if (gender == "female") {
            src_name = this.name_f;
            src_cognomen = this.cognomen_f;
        }

        // генерируем имя
        result = engine.getRndNameParts( src_name );
        original    += result[0] + ' ';

        // генерируем фамилию
        result = engine.getRndNameParts( src_cognomen );
        original    += result[0];

        return {
            'original'  :   original,
            'translated':   translated
        };
    },

    printName: function(string) {
        return out = string.original;
    }
};